{
  "name": "Settings",
  "_id": "s3db8C5koqDoVlBG",
  "pages": [
    {
      "sort": 100000,
      "name": "Settings",
      "type": "text",
      "_id": "tlcX7BTYLjnliPDi",
      "system": {},
      "title": {
        "show": true,
        "level": 1
      },
      "image": {},
      "text": {
        "format": 1,
        "content": "<p>The following settings are available in the module settings panel. These settings are world-scoped and apply to all users in the world.</p><h2>Apply Elevation to Selected</h2><p>When applying elevation via a token's HUD, apply it to all selected tokens. This is useful for moving a group of tokens to the same elevation at once, such as when the party ascends a staircase or flies to a new height.</p><h2>Max Ability Score</h2><p>Sets the maximum ability score a character can have. The default value is 20. Increasing this value allows ability scores to exceed the normal cap, which may be useful for epic-level campaigns or homebrew rules.</p><h2>Max Level</h2><p>Sets the maximum character level allowed. The default value is 20. This can be increased for campaigns that extend beyond the standard level range.</p><h2>Radial Status Effects</h2><p>When enabled, status effect icons are displayed in a circular layout around the token rather than the default grid layout. Icons are shown with a circular background. This provides a cleaner appearance, especially on tokens with multiple status effects.</p><p>Requires a reload when changed.</p><h2>Ruler Travel Time</h2><p>When enabled, the measuring tool displays estimated D&amp;D 5e travel time below the distance measurement. Three travel paces are shown:</p><ul><li><i class=\"fa-solid fa-person-running\" style=\"display:inline-block;width:1.25em;text-align:center\"></i> <strong>Fast pace</strong> — 400 feet per minute, 4 miles per hour, 30 miles per day</li><li><i class=\"fa-solid fa-person-walking\" style=\"display:inline-block;width:1.25em;text-align:center\"></i> <strong>Normal pace</strong> — 300 feet per minute, 3 miles per hour, 24 miles per day</li><li><i class=\"fa-solid fa-person-hiking\" style=\"display:inline-block;width:1.25em;text-align:center\"></i> <strong>Slow pace</strong> — 200 feet per minute, 2 miles per hour, 18 miles per day</li></ul><p>Travel time uses 8-hour travel days as per the standard D&amp;D 5e rules. Travel time is not displayed during combat. This setting only applies when the grid units are set to feet or miles.</p><p>Requires a reload when changed.</p><h2>Show Pressed Keys</h2><p>When enabled, an icon appears near the cursor when the Skip Dialog, Advantage, or Disadvantage keys are pressed while hovering over a rollable element such as an attack button or item use button. This provides a visual indicator of the active modifier before clicking.</p><p>Requires a reload when changed.</p><h2>Token Border Shape</h2><p>Choose the shape of the token's border when it is selected or hovered. Options include circle and square. The default is square, matching the standard Foundry VTT behaviour.</p><p>Requires a reload when changed.</p><h2>Toggle Status Effects on Selected</h2><p>When toggling a status effect via a token's HUD, toggle it for all selected tokens. This is useful for applying or removing a condition from multiple tokens at once, such as applying the Frightened condition to a group of enemies.</p><p>Requires a reload when changed.</p>"
      },
      "video": {
        "controls": true,
        "volume": 0.5
      },
      "src": null,
      "ownership": {
        "default": -1,
        "JdWLPbQd9x1aeEfz": 3
      },
      "flags": {},
      "_stats": {
        "compendiumSource": null,
        "duplicateSource": null,
        "coreVersion": "13.351",
        "systemId": "dnd5e",
        "systemVersion": "4.2.2",
        "createdTime": 1739900000000,
        "modifiedTime": 1739900000000,
        "lastModifiedBy": "JdWLPbQd9x1aeEfz",
        "exportSource": null
      },
      "category": null,
      "_key": "!journal.pages!s3db8C5koqDoVlBG.tlcX7BTYLjnliPDi"
    }
  ],
  "folder": null,
  "sort": 0,
  "ownership": {
    "default": 0,
    "JdWLPbQd9x1aeEfz": 3
  },
  "flags": {},
  "_stats": {
    "compendiumSource": null,
    "duplicateSource": null,
    "coreVersion": "13.351",
    "systemId": "dnd5e",
    "systemVersion": "4.2.2",
    "createdTime": 1739900000000,
    "modifiedTime": 1739900000000,
    "lastModifiedBy": "JdWLPbQd9x1aeEfz",
    "exportSource": null
  },
  "categories": [],
  "_key": "!journal!s3db8C5koqDoVlBG"
}
